/*************************************************************
    * Число вампира *
    
    Наше расплывчатое определение числа вампиров можно описать следующим образом:

        6 * 21 = 126
        6 и 21 были бы допустимыми "клыками" для числа вампиров, 
        поскольку цифры 6, 1 и 2 присутствуют как в произведении, так и в множителях

        10 * 11 = 110
        110 не является числом вампира, так как в множителях 
        есть три единицы, но только две единицы в произведении

    Создайте функцию, которая может принимать два "клыка" и определять, 
    является ли произведение двух чисел - числом вампира.

*************************************************************/


namespace Vampire_Numbers;


public static class Kata
{
    public static bool vampire_test(long x, long y)
    {
        return false;
    }
}